job = """Я хотел бы стать не богатым а узнаваемым, страна неважна, 
ведь у программистом нет понятия место, но условия должен быть
, это даст продуктивности программиста. Рабочий день, главная чтобы 
глаза не устали, иначе говоря отдых после часа работы, в общем максимум
 8 час в день.Зарплата чтобы хватало компортно жить, 
примерно 50000 сом хватить с головой. Поступая в университет 
я не думал чтобы стать богатым и зарабатывать много, всегда интересовался
миром IT, какого быть программистом, внести вклад в развитии чему то хорошему
. Нравится долго думать,размышлять, решать различные задачи.
Рад что меня взяли, в свою очередь постараюсть вас догнать 
"""
print(job)

